{
  "title": "Cybercriminals Abuse Google Cloud Email Feature in Multi-Stage Phishing Campaign",
  "link": "https://thehackernews.com/2026/01/cybercriminals-abuse-google-cloud-email.html",
  "published": "Fri, 02 Jan 2026 14:44:00 +0530",
  "text": "Cybercriminals Abuse Google Cloud Email Feature in Multi-Stage Phishing Campaign #1 Trusted Cybersecurity News Platform Followed by 5.20+ million       Subscribe – Get Latest News  Home  Newsletter  Webinars Home Data Breaches Cyber Attacks Vulnerabilities Webinars Expert Insights Contact    Resources Webinars Free eBooks About Site About THN Jobs Advertise with us Contact/Tip Us  Reach out to get featured—contact us to send your exclusive story idea, research, hacks, or ask us a question or leave a comment/feedback! Follow Us On Social Media       RSS Feeds  Email Alerts Cybercriminals Abuse Google Cloud Email Feature in Multi-Stage Phishing Campaign  Jan 02, 2026  Ravie Lakshmanan Cloud Security / Email Security Cybersecurity researchers have disclosed details of a phishing campaign that involves the attackers impersonating legitimate Google-generated messages by abusing Google Cloud's Application Integration service to distribute emails. The activity, Check Point said, takes advantage of the trust associated with Google Cloud infrastructure to send the messages from a legitimate email address (\"noreply-application-integration@google[.]com\") so that they can bypass traditional email security filters and have a better chance of landing in users' inboxes. \"The emails mimic routine enterprise notifications such as voicemail alerts and file access or permission requests, making them appear normal and trustworthy to recipients,\" the cybersecurity company said . Attackers have been observed sending 9,394 phishing emails targeting approximately 3,200 customers over a 14-day period observed in December 2025, with the affected organizations located in the U.S., Asia-Pacific, Europe, Canada, and Latin America. At the heart of the campaign is the abuse of Application Integration's \" Send Email \" task, which allows users to send custom email notifications from an integration. Google notes in its support documentation that only a maximum of 30 recipients can be added to the task. The fact that these emails can be configured to be sent to any arbitrary email addresses demonstrates the threat actor's ability to misuse a legitimate automation capability to their advantage and send emails from Google-owned domains, effectively bypassing DMARC and SPF checks . \"To further increase trust, the emails closely followed Google notification style and structure, including familiar formatting and language,\" Check Point said. \"The lures commonly referenced voicemail messages or claims that the recipient had been granted access to a shared file or document, such as access to a 'Q4' file, prompting recipients to click embedded links and take immediate action.\" The attack chain is a multi-stage redirection flow that commences when an email recipient clicks on a link hosted on storage.cloud.google[.]com, another trusted Google Cloud service. The effort is seen as another effort to lower user suspicion and give it a veneer of legitimacy. The link then redirects the user to content served from googleusercontent[.]com, presenting them with a fake CAPTCHA or image-based verification that acts as a barrier by blocking automated scanners and security tools from scrutinizing the attack infrastructure, while allowing real users to pass through. Once the validation phase is complete, the user is taken to a fake Microsoft login page that's hosted on a non-Microsoft domain, ultimately stealing any credentials entered by the victims. In response to the findings, Google has blocked the phishing efforts that abuse the email notification feature within Google Cloud Application Integration, adding that it's taking more steps to prevent further misuse. Check Point's analysis has revealed that the campaign has primarily targeted manufacturing, technology, financial, professional services, and retail sectors, although other industry verticals, including media, education, healthcare, energy, government, travel, and transportation, have been singled out. \"These sectors commonly rely on automated notifications, shared documents, and permission-based workflows, making Google-branded alerts especially convincing,\" it added. \"This campaign highlights how attackers can misuse legitimate cloud automation and workflow features to distribute phishing at scale without traditional spoofing.\" ' Update Both xorlab and Ravenmail have disclosed details of the credential harvesting campaign, with the former noting that the attacks are also being used to carry out OAuth consent phishing , as well as host the fake login pages on Amazon Web Services (AWS) S3 buckets. \"The attackers trick victims into granting a malicious Azure AD application access to their cloud resources – gaining access to Azure subscriptions, VMs, storage, and databases via delegated permissions that persist through access and refresh tokens,\" xorlab said. \"Each hop uses trusted infrastructure – Google, Microsoft, AWS – making the attack difficult to detect or block at any single point. Regardless of the entry point, victims eventually land on the Microsoft 365 login page, revealing the attackers' primary target: M365 credentials.\" Found this article interesting? Follow us on Google News , Twitter and LinkedIn to read more exclusive content we post. SHARE      Tweet  Share  Share  Share   Share on Facebook  Share on Twitter  Share on Linkedin  Share on Reddit  Share on Hacker News  Share on Email  Share on WhatsApp Share on Facebook Messenger  Share on Telegram SHARE  Cloud security Credential Theft cybersecurity email security enterprise security Google Cloud identity theft Phishing social engineering Threat Intelligence Trending News DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide CSA Issues Alert on Critical SmarterMail Bug Allowing Remote Code Execution ⚡ Weekly Recap: MongoDB Attacks, Wallet Breaches, Android Spyware, Insider Crime and More MongoDB Vulnerability CVE-2025-14847 Under Active Exploitation Worldwide Trust Wallet Chrome Extension Breach Caused $7 Million Crypto Loss via Malicious Code Critical LangChain Core Vulnerability Exposes Secrets via Serialization Injection LastPass 2022 Breach Led to Years-Long Cryptocurrency Thefts, TRM Labs Finds Fortinet Warns of Active Exploitation of FortiOS SSL VPN 2FA Bypass Vulnerability New MacSync macOS Stealer Uses Signed App to Bypass Apple Gatekeeper Two Chrome Extensions Caught Secretly Stealing Credentials from Over 170 Sites U.S. DoJ Seizes Fraud Domain Behind $14.6 Million Bank Account Takeover Scheme Critical n8n Flaw (CVSS 9.9) Enables Arbitrary Code Execution Across Thousands of Instances Fake WhatsApp API Package on npm Steals Messages, Contacts, and Login Tokens Android Malware Operations Merge Droppers, SMS Theft, and RAT Capabilities at Scale Popular Resources Master CISSP, CCSP, and CISM With Zero Wasted Hours Level Up in Six Days: Join SANS Security Central 2026 in New Orleans Passwd - Get the Best Team Password Manager for Google Workspace See How Seraphic Turns Any Browser Into a Zero-Trust Enterprise Shield Cybersecurity Webinars Simplify SOC Operations How AI and Zero Trust Work Together to Catch Attacks With No Files or Indicators Modern cyberattacks hide in trusted tools and workflows, evading traditional defenses. Zero Trust and AI-powered cloud security give you the visibility and control to stop these invisible threats early. Register Stop Blind Trust in IDE AI Tools How to Audit MCP Servers and Stop Shadow API Key Sprawl in One Sweep Agentic AI is accelerating development—and risk. MCP servers and shadow API keys are spreading fast across IDEs. Learn how to regain visibility, enforce control, and secure agentic AI before speed turns into breach. Register Latest News Cybersecurity Resources Zero Trust + AI: Thrive in the AI Era and Remain Resilient Zero Trust Everywhere - protection across your workforce, branches, and clouds, and GenAI.. Attacks Are Rising. Are Your Cyber Skills Surge-Ready? Bigger threats, higher stakes. Build resilient SEC401 skills at SANS Surge 2026. Earn a Master's in Cybersecurity Risk Management Lead the future of cybersecurity risk management with an online Master's from Georgetown. ​ Expert Insights Articles Videos Purdue University's Real-World Deepfake Detection Benchmark Raises the Bar for Enterprise Models  December 22, 2025 Read ➝ AI in IAM: Is it Truly Valuable?  December 10, 2025 Read ➝ What GTG-1002 and Claude-Style Attacks Mean for SaaS Verification  December 8, 2025 Read ➝ Beyond Point-in-Time: The ROI Case for Continuous Pentesting  December 1, 2025 Read ➝ Get Latest News in Your Inbox Get the latest news, expert insights, exclusive resources, and strategies from industry leaders – all for free. Email Connect with us!  935,000 Followers  686,000 Followers  24,500 Subscribers  146,200 Followers  1,899,000 Followers 34,500 Followers Company About THN Advertise with us Contact Pages Webinars Privacy Policy  RSS Feeds  Contact Us © The Hacker News, 2025. All Rights Reserved."
}