{
  "title": "CISA Releases One Industrial Control Systems Advisory",
  "link": "https://www.cisa.gov/news-events/alerts/2025/12/23/cisa-releases-one-industrial-control-systems-advisory",
  "published": "Tue, 23 Dec 25 12:00:00 +0000",
  "text": "CISA Releases One Industrial Control Systems Advisory | CISA Skip to main content An official website of the United States government Here’s how you know Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( ) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites. no-cost Cyber Services Secure by design Holiday Online Shopping Safety Shields Up Report A Cyber Issue Search Menu Close Topics Topics Cybersecurity Best Practices Cyber Threats and Advisories Critical Infrastructure Security and Resilience Election Security Emergency Communications Industrial Control Systems Information and Communications Technology Supply Chain Security Partnerships and Collaboration Physical Security Risk Management How can we help? Government Educational Institutions Industry State, Local, Tribal, and Territorial Individuals and Families Small and Medium Businesses Find Help Locally Faith-Based Community Executives High-Risk Communities Spotlight Resources & Tools Resources & Tools All Resources & Tools Services Programs Resources Training Groups News & Events News & Events News Events Cybersecurity Alerts & Advisories Directives Request a CISA Speaker Congressional Testimony CISA Conferences CISA Live! Careers Careers Benefits & Perks HireVue Applicant Reasonable Accommodations Process Hiring Resume & Application Tips Students & Recent Graduates Veteran and Military Spouses About About Divisions & Offices Regions Leadership Doing Business with CISA Site Links CISA GitHub CISA Central Contact Us Subscribe Transparency and Accountability Policies & Plans no-cost Cyber Services Secure by design Holiday Online Shopping Safety Shields Up Report A Cyber Issue Breadcrumb Home News & Events Cybersecurity Advisories Alert CISA Releases One Industrial Control Systems Advisory Share: Alert CISA Releases One Industrial Control Systems Advisory Release Date December 23, 2025 Related topics: Industrial Control System Vulnerabilities , Industrial Control Systems CISA released one Industrial Control Systems (ICS) Advisory. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-177-01 Mitsubishi Electric Air Conditioning Systems (Update B) CISA encourages users and administrators to review the newly released ICS advisory for technical details and mitigations. This product is provided subject to this Notification and this Privacy & Use policy. Vendor Mitsubishi Electric Tags Topics : Industrial Control System Vulnerabilities , Industrial Control Systems Please share your thoughts We recently updated our anonymous product survey ; we welcome your feedback. Related Advisories Dec 30, 2025 Alert CISA Releases Two Industrial Control Systems Advisories Dec 18, 2025 Alert CISA Releases Nine Industrial Control Systems Advisories Dec 16, 2025 Alert CISA Releases Six Industrial Control Systems Advisories Dec 11, 2025 Alert CISA Releases 12 Industrial Control Systems Advisories Return to top Topics Spotlight Resources & Tools News & Events Careers About Cybersecurity & Infrastructure Security Agency Facebook X LinkedIn YouTube Instagram RSS CISA Central 1-844-Say-CISA contact@cisa.dhs.gov DHS Seal CISA.gov An official website of the U.S. Department of Homeland Security About CISA Budget and Performance DHS.gov FOIA Requests No FEAR Act Office of Inspector General Privacy Policy Subscribe The White House USA.gov Website Feedback"
}