{
  "title": "CrowdTour 2026: Securing the AI Era Together",
  "link": "https://www.crowdstrike.com/en-us/blog/crowdtour-2026-securing-ai-era-together/",
  "published": "Dec 19, 2025 00:00:00-0600",
  "text": "CrowdTour 2026: Securing the AI Era Together | CrowdStrike BLOG Featured Streamline Security Operations with Falcon for IT’s Turnkey Automations Dec 29, 2025 How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing Dec 22, 2025 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents Dec 19, 2025 CrowdTour 2026: Securing the AI Era Together Dec 19, 2025 Recent Streamline Security Operations with Falcon for IT’s Turnkey Automations Dec 29, 2025 How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing Dec 22, 2025 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents Dec 19, 2025 CrowdTour 2026: Securing the AI Era Together Dec 19, 2025 Video Video Highlights the 4 Key Steps to Successful Incident Response Dec 02, 2019 Helping Non-Security Stakeholders Understand ATT&CK in 10 Minutes or Less [VIDEO] Feb 21, 2019 Analyzing Targeted Intrusions Through the ATT&CK Framework Lens [VIDEO] Jan 22, 2019 Qatar’s Commercial Bank Chooses CrowdStrike Falcon®: A Partnership Based on Trust [VIDEO] Aug 20, 2018 Category Agentic SOC Agentic SOC How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing 12/22/25 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents 12/19/25 CrowdTour 2026: Securing the AI Era Together 12/19/25 CrowdStrike Leverages NVIDIA Nemotron in Amazon Bedrock to Advance Agentic Security 12/02/25 Cloud & Application Security Cloud & Application Security CrowdStrike Unveils Real-Time Cloud Detection and Response Innovations 12/01/25 New User Experience Transforms Interaction with the Falcon Platform 10/21/25 How Falcon ASPM Secures GenAI Applications and Lessons from Dogfooding 09/30/25 CrowdStrike Named a Frost Radar™ Leader in Cloud Workload Protection Platforms 09/25/25 Threat Hunting & Intel Threat Hunting & Intel Unveiling WARP PANDA: A New Sophisticated China-Nexus Adversary 12/04/25 CrowdStrike Research: Security Flaws in DeepSeek-Generated Code Linked to Political Triggers 11/20/25 CrowdStrike 2025 European Threat Landscape Report: Extortion Rises, Nation-State Activity Intensifies 11/03/25 CrowdStrike 2025 APJ eCrime Landscape Report: A New Era of Threats Emerges 10/20/25 Endpoint Security & XDR Endpoint Security & XDR Streamline Security Operations with Falcon for IT’s Turnkey Automations 12/29/25 CrowdStrike Endpoint Security Achieves 273% ROI Over Three Years 12/17/25 CrowdStrike Achieves 100% Detection, 100% Protection, and Zero False Positives in 2025 MITRE ATT&CK® Enterprise Evaluations 12/10/25 Defeating BLOCKADE SPIDER: How CrowdStrike Stops Cross-Domain Attacks 11/18/25 Engineering & Tech Engineering & Tech EMBER2024: Advancing the Training of Cybersecurity ML Models Against Evasive Malware 09/03/25 Falcon Platform Prevents COOKIE SPIDER’s SHAMOS Delivery on macOS 08/20/25 CrowdStrike’s Approach to Better Machine Learning Evaluation Using Strategic Data Splitting 08/11/25 CrowdStrike Researchers Develop Custom XGBoost Objective to Improve ML Model Release Stability 03/20/25 Executive Viewpoint Executive Viewpoint The Dawn of the Agentic SOC: Reimagining Cybersecurity for the AI Era 09/26/25 CrowdStrike Falcon Platform Evolves to Lead the Agentic Security Era 09/16/25 CrowdStrike to Acquire Pangea to Secure Enterprise AI Use and Development 09/15/25 CrowdStrike to Acquire Onum to Transform How Data Powers the Agentic SOC 08/27/25 From The Front Lines From The Front Lines CrowdStrike Named a Leader in 2025 IDC MarketScape for Worldwide Incident Response Services 08/27/25 CrowdStrike Launches New AI Security Services to Strengthen AI Security and SOC Readiness 08/06/25 CrowdStrike Detects and Blocks Initial SharePoint Zero-Day Exploitation 07/21/25 Prescription for Protection: Healthcare Industry Observations from CrowdStrike Investigations 07/01/25 Next-Gen Identity Security Next-Gen Identity Security Falcon Shield Evolves with AI Agent Visibility and Falcon Next-Gen SIEM Integration 12/08/25 CrowdStrike Named Overall Leader in 2025 KuppingerCole ITDR Leadership Compass 11/10/25 CrowdStrike Named the Leader in 2025 Frost Radar for SaaS Security Posture Management 10/27/25 From Domain User to SYSTEM: Analyzing the NTLM LDAP Authentication Bypass Vulnerability (CVE-2025-54918) 10/22/25 Next-Gen SIEM & Log Management Next-Gen SIEM & Log Management Transform AWS Security Operations with Falcon Next-Gen SIEM 12/01/25 CrowdStrike Leads New Evolution of Security Automation with Charlotte Agentic SOAR 11/05/25 CrowdStrike Named a Visionary in 2025 Gartner® Magic Quadrant™ for Security Information and Event Management 10/10/25 CrowdStrike Boosts SOC Detection Content with Correlation Rule Template Discovery Dashboard 09/29/25 Public Sector Public Sector CrowdStrike Achieves FedRAMP® High Authorization 03/19/25 NHS Matures Healthcare Cybersecurity with NCSC’s CAF Assurance Model 03/13/25 Zero Trust Strengthens Data Protection to Achieve National Cyber Strategy Goals 01/15/25 CrowdStrike Statement on Bloomberg’s October 25, 2024 Story 10/25/24 Exposure Management Exposure Management Inside the Latest Innovations Powering Falcon Exposure Management 12/12/25 December 2025 Patch Tuesday: One Critical Zero-Day, Two Publicly Disclosed Vulnerabilities Among 57 CVEs 12/09/25 From Vulnerability Management to Exposure Management: The Platform Era Has Arrived 11/13/25 November 2025 Patch Tuesday: One Zero-Day and Five Critical Vulnerabilities Among 63 CVEs 11/12/25 Data Protection Data Protection Falcon Data Protection for Cloud Extends DSPM into Runtime 11/20/25 CrowdStrike Stops GenAI Data Leaks with Unified Data Protection 09/18/25 Q&A: How Mastronardi Produce Secures Innovation with CrowdStrike 02/14/25 5 Key Data Protection Challenges and How to Overcome Them 12/11/24 Securing AI Securing AI CrowdStrike Secures Growing AI Attack Surface with Falcon AI Detection and Response 12/15/25 Data Leakage: AI’s Plumbing Problem 12/11/25 Indirect Prompt Injection Attacks: A Lurking Risk to AI Systems 12/04/25 Secure AI at Machine Speed: Defending the Growing Attack Surface 09/02/25 Start Free Trial Featured Recent Video Category Start Free Trial CrowdTour 2026: Securing the AI Era Together December 19, 2025 | Gautam Mehandru | Agentic SOC The AI era is here — and it’s redefining cybersecurity. Organizations around the globe are adopting and operationalizing AI to drive innovation. At the same time, adversaries are embracing AI to increase the speed, scale, and sophistication of their attacks. In this time of transformation, there is a tremendous opportunity for industry experts to come together and learn from one another to understand how AI is reshaping security. This is what CrowdTour 2026 delivers. Now in its third year, CrowdStrike’s global cybersecurity roadshow brings executives, practitioners, architects, and innovators together to navigate the realities of AI-powered defense. CrowdStrike is uniting this community through expert guidance, training, and real-world experiences from defenders on the front lines. Across more than 60 cities worldwide, attendees will hear customer stories that ground AI security in practice and collaborate with their peers on strategies that stop breaches at machine speed. CrowdTour 2026 will give attendees a front-row seat to how leading organizations are transforming their SOCs and securing the systems that power modern business — and how they’re using the single, unified CrowdStrike Falcon® platform to do it. Outsmart Adversaries in the AI Era CrowdTour 2026 is built for security leaders and practitioners who want to strengthen their strategies and sharpen outcomes in a world driven by AI. Each event focuses on three defining themes for modern defense: Defeat the AI-accelerated adversary: Learn how attackers are using AI to accelerate and evolve, and see how to stay ahead of them through live demos, hands-on sessions, and expert insights. Improve outcomes with agentic SOC transformation: Discover how AI-powered automation is turning the SOC into an intelligent command center that unifies protection and streamlines workflows to deliver results at machine speed. Govern and secure AI across the attack surface: Learn how to protect data, agents, identities, and models from manipulation and misuse across the enterprise so you can safely innovate with AI. Together, these pillars define the challenges defenders face today — and the practical skills and strategies attendees will take home from CrowdTour. Participants will explore AI-native detection, response, and automation through expert content, frontline perspectives, and interactive sessions that align with the themes above. These sessions will provide actionable insights teams can bring back to their organizations. In addition, attendees can look forward to dedicated networking opportunities with peers, partners, and CrowdStrike experts. For many attendees, CrowdTour is just the beginning of their CrowdStrike journey. It’s a chance to learn, connect, and build momentum before the industry comes together later in the year at Fal.Con 2026 for the next evolution of ideas. Experience the Power of the Crowd The CrowdStrike community continues to grow, and we are scaling CrowdTour accordingly. CrowdTour 2026 will bring 60+ events to cities across North America, South America, META, Europe, and the Asia-Pacific region — more than double the number of events of CrowdTour 2025. CrowdTour, along with Fal.Con, is part of CrowdStrike’s marquee event programming, which brings education, industry expertise, and customer perspective that can’t be found anywhere else. From Singapore to São Paulo and London to Los Angeles, CrowdTour 2026 brings the Power of the Crowd to your doorstep. CrowdTour 2026 is where defenders gain the insights, experience, and connections to secure AI adoption, modernize security operations, and stay ahead of AI-driven adversaries. Join your peers and the CrowdStrike team as we continue leading cybersecurity in the AI era together. Find a CrowdTour 2026 stop near you and register today for your regional event. Tweet Share Related Content How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents CrowdStrike Leverages NVIDIA Nemotron in Amazon Bedrock to Advance Agentic Security Categories Agentic SOC 44 Cloud & Application Security 137 Data Protection 18 Endpoint Security & XDR 345 Engineering & Tech 85 Executive Viewpoint 176 Exposure Management 112 From The Front Lines 197 Next-Gen Identity Security 62 Next-Gen SIEM & Log Management 108 Public Sector 40 Securing AI 19 Threat Hunting & Intel 206 CONNECT WITH US FEATURED ARTICLES October 01, 2024 CrowdStrike Named a Leader in 2024 Gartner® Magic Quadrant™ for Endpoint Protection Platforms September 25, 2024 Recognizing the Resilience of the CrowdStrike Community September 25, 2024 CrowdStrike Drives Cybersecurity Forward with New Innovations Spanning AI, Cloud, Next-Gen SIEM and Identity Protection September 18, 2024 SUBSCRIBE Sign up now to receive the latest notifications and updates from CrowdStrike. Sign Up See CrowdStrike Falcon ® in Action Detect, prevent, and respond to attacks— even malware-free intrusions—at any stage, with next-generation endpoint protection. See Demo CrowdStrike Leverages NVIDIA Nemotron in Amazon Bedrock to Advance Agentic Security Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents Copyright © 2025 CrowdStrike Privacy Request Info Blog Contact Us 1.888.512.8906 Accessibility"
}