{
  "title": "December 2025 Patch Tuesday: One Critical Zero-Day, Two Publicly Disclosed Vulnerabilities Among 57 CVEs",
  "link": "https://www.crowdstrike.com/en-us/blog/patch-tuesday-analysis-december-2025/",
  "published": "Dec 09, 2025 00:00:00-0600",
  "text": "December 2025 Patch Tuesday: Updates and Analysis | CrowdStrike BLOG Featured Streamline Security Operations with Falcon for IT’s Turnkey Automations Dec 29, 2025 How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing Dec 22, 2025 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents Dec 19, 2025 CrowdTour 2026: Securing the AI Era Together Dec 19, 2025 Recent Streamline Security Operations with Falcon for IT’s Turnkey Automations Dec 29, 2025 How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing Dec 22, 2025 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents Dec 19, 2025 CrowdTour 2026: Securing the AI Era Together Dec 19, 2025 Video Video Highlights the 4 Key Steps to Successful Incident Response Dec 02, 2019 Helping Non-Security Stakeholders Understand ATT&CK in 10 Minutes or Less [VIDEO] Feb 21, 2019 Analyzing Targeted Intrusions Through the ATT&CK Framework Lens [VIDEO] Jan 22, 2019 Qatar’s Commercial Bank Chooses CrowdStrike Falcon®: A Partnership Based on Trust [VIDEO] Aug 20, 2018 Category Agentic SOC Agentic SOC How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing 12/22/25 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents 12/19/25 CrowdTour 2026: Securing the AI Era Together 12/19/25 CrowdStrike Leverages NVIDIA Nemotron in Amazon Bedrock to Advance Agentic Security 12/02/25 Cloud & Application Security Cloud & Application Security CrowdStrike Unveils Real-Time Cloud Detection and Response Innovations 12/01/25 New User Experience Transforms Interaction with the Falcon Platform 10/21/25 How Falcon ASPM Secures GenAI Applications and Lessons from Dogfooding 09/30/25 CrowdStrike Named a Frost Radar™ Leader in Cloud Workload Protection Platforms 09/25/25 Threat Hunting & Intel Threat Hunting & Intel Unveiling WARP PANDA: A New Sophisticated China-Nexus Adversary 12/04/25 CrowdStrike Research: Security Flaws in DeepSeek-Generated Code Linked to Political Triggers 11/20/25 CrowdStrike 2025 European Threat Landscape Report: Extortion Rises, Nation-State Activity Intensifies 11/03/25 CrowdStrike 2025 APJ eCrime Landscape Report: A New Era of Threats Emerges 10/20/25 Endpoint Security & XDR Endpoint Security & XDR Streamline Security Operations with Falcon for IT’s Turnkey Automations 12/29/25 CrowdStrike Endpoint Security Achieves 273% ROI Over Three Years 12/17/25 CrowdStrike Achieves 100% Detection, 100% Protection, and Zero False Positives in 2025 MITRE ATT&CK® Enterprise Evaluations 12/10/25 Defeating BLOCKADE SPIDER: How CrowdStrike Stops Cross-Domain Attacks 11/18/25 Engineering & Tech Engineering & Tech EMBER2024: Advancing the Training of Cybersecurity ML Models Against Evasive Malware 09/03/25 Falcon Platform Prevents COOKIE SPIDER’s SHAMOS Delivery on macOS 08/20/25 CrowdStrike’s Approach to Better Machine Learning Evaluation Using Strategic Data Splitting 08/11/25 CrowdStrike Researchers Develop Custom XGBoost Objective to Improve ML Model Release Stability 03/20/25 Executive Viewpoint Executive Viewpoint The Dawn of the Agentic SOC: Reimagining Cybersecurity for the AI Era 09/26/25 CrowdStrike Falcon Platform Evolves to Lead the Agentic Security Era 09/16/25 CrowdStrike to Acquire Pangea to Secure Enterprise AI Use and Development 09/15/25 CrowdStrike to Acquire Onum to Transform How Data Powers the Agentic SOC 08/27/25 From The Front Lines From The Front Lines CrowdStrike Named a Leader in 2025 IDC MarketScape for Worldwide Incident Response Services 08/27/25 CrowdStrike Launches New AI Security Services to Strengthen AI Security and SOC Readiness 08/06/25 CrowdStrike Detects and Blocks Initial SharePoint Zero-Day Exploitation 07/21/25 Prescription for Protection: Healthcare Industry Observations from CrowdStrike Investigations 07/01/25 Next-Gen Identity Security Next-Gen Identity Security Falcon Shield Evolves with AI Agent Visibility and Falcon Next-Gen SIEM Integration 12/08/25 CrowdStrike Named Overall Leader in 2025 KuppingerCole ITDR Leadership Compass 11/10/25 CrowdStrike Named the Leader in 2025 Frost Radar for SaaS Security Posture Management 10/27/25 From Domain User to SYSTEM: Analyzing the NTLM LDAP Authentication Bypass Vulnerability (CVE-2025-54918) 10/22/25 Next-Gen SIEM & Log Management Next-Gen SIEM & Log Management Transform AWS Security Operations with Falcon Next-Gen SIEM 12/01/25 CrowdStrike Leads New Evolution of Security Automation with Charlotte Agentic SOAR 11/05/25 CrowdStrike Named a Visionary in 2025 Gartner® Magic Quadrant™ for Security Information and Event Management 10/10/25 CrowdStrike Boosts SOC Detection Content with Correlation Rule Template Discovery Dashboard 09/29/25 Public Sector Public Sector CrowdStrike Achieves FedRAMP® High Authorization 03/19/25 NHS Matures Healthcare Cybersecurity with NCSC’s CAF Assurance Model 03/13/25 Zero Trust Strengthens Data Protection to Achieve National Cyber Strategy Goals 01/15/25 CrowdStrike Statement on Bloomberg’s October 25, 2024 Story 10/25/24 Exposure Management Exposure Management Inside the Latest Innovations Powering Falcon Exposure Management 12/12/25 December 2025 Patch Tuesday: One Critical Zero-Day, Two Publicly Disclosed Vulnerabilities Among 57 CVEs 12/09/25 From Vulnerability Management to Exposure Management: The Platform Era Has Arrived 11/13/25 November 2025 Patch Tuesday: One Zero-Day and Five Critical Vulnerabilities Among 63 CVEs 11/12/25 Data Protection Data Protection Falcon Data Protection for Cloud Extends DSPM into Runtime 11/20/25 CrowdStrike Stops GenAI Data Leaks with Unified Data Protection 09/18/25 Q&A: How Mastronardi Produce Secures Innovation with CrowdStrike 02/14/25 5 Key Data Protection Challenges and How to Overcome Them 12/11/24 Securing AI Securing AI CrowdStrike Secures Growing AI Attack Surface with Falcon AI Detection and Response 12/15/25 Data Leakage: AI’s Plumbing Problem 12/11/25 Indirect Prompt Injection Attacks: A Lurking Risk to AI Systems 12/04/25 Secure AI at Machine Speed: Defending the Growing Attack Surface 09/02/25 Start Free Trial Featured Recent Video Category Start Free Trial December 2025 Patch Tuesday: One Critical Zero-Day, Two Publicly Disclosed Vulnerabilities Among 57 CVEs December 09, 2025 | Falcon Exposure Management Team | Exposure Management Microsoft has addressed 57 vulnerabilities in its December 2025 security update release. This month's updates address one actively exploited Important zero-day, two publicly disclosed Important zero-days, and two Critical vulnerabilities, along with 52 additional vulnerabilities of varying severity levels. December 2025 Risk Analysis This month's leading risk types by exploitation technique are elevation of privilege with 28 patches (49%), remote code execution (RCE) with 19 patches (34%), and information disclosure with 4 patches (7%). Figure 1. Breakdown of December 2025 Patch Tuesday exploitation techniques Microsoft Windows received the most patches this month with 38, followed by Microsoft Office with 14. Figure 2. Breakdown of product families affected by December 2025 Patch Tuesday Zero-Day Vulnerability in Windows Cloud Files Mini Filter Driver CVE-2025-62221 is an Important elevation of privilege vulnerability affecting Windows Cloud Files Mini Filter Driver and has a CVSS score of 7.8 . This vulnerability allows authenticated local attackers with low privileges to elevate their privileges to SYSTEM level by exploiting a use-after-free weakness in the Windows Cloud Files Mini Filter Driver through local access to the system. There is evidence of active exploitation in the wild. Microsoft has confirmed that exploitation has been detected, though the vulnerability had not been publicly disclosed and specific details about the exploitation methods have not been shared. The vulnerability affects Windows systems running Cloud Files Mini Filter Driver and requires local access, low privileges, and no user interaction to exploit, with low attack complexity. When successfully exploited, it allows attackers to gain SYSTEM privileges, potentially allowing them to completely compromise the affected Windows systems. Microsoft has released an official fix to address this vulnerability. Organizations should prioritize applying the available security update to protect against exploitation. Table 1. Important zero-day vulnerability in Windows Cloud Files Mini Filter Driver Severity CVSS Score CVE Description Important 7.8 CVE-2025-62221 Windows Cloud Files Mini Filter Driver Elevation of Privilege Vulnerability Publicly Disclosed Zero-Day Vulnerability in GitHub Copilot for JetBrains CVE-2025-64671 is an Important remote code execution vulnerability affecting GitHub Copilot for JetBrains and has a CVSS score of 8.4 . This vulnerability allows unauthenticated local attackers to execute arbitrary code by exploiting a command injection weakness in Copilot through local access to the system. While the vulnerability has been publicly disclosed, there is no evidence of active exploitation in the wild. Microsoft has assessed exploitation as \"Less Likely\" with an unproven exploit code maturity rating. The vulnerability affects GitHub Copilot for JetBrains and requires no privileges and no user interaction to exploit, with low attack complexity. An attacker could exploit this vulnerability via a malicious cross-prompt injection in untrusted files or MCP servers, allowing them to execute additional commands by appending them to commands allowed in the user's terminal auto-approve setting. Table 2. Publicly disclosed zero-day vulnerability in GitHub Copilot for JetBrains Severity CVSS Score CVE Description Important 8.4 CVE-2025-64671 GitHub Copilot for JetBrains Remote Code Execution Vulnerability Publicly Disclosed Zero-Day Vulnerability in PowerShell CVE-2025-54100 is an Important remote code execution vulnerability affecting Windows PowerShell and has a CVSS score of 7.8 . This vulnerability allows unauthenticated local attackers to execute arbitrary code by exploiting a command injection weakness in PowerShell through local access to the system. While the vulnerability has been publicly disclosed, there is no evidence of active exploitation in the wild. Microsoft has assessed exploitation as \"Less Likely\" with an unproven exploit code maturity rating. The vulnerability affects Windows PowerShell and requires no privileges but does require user interaction to exploit, with low attack complexity. An attacker could exploit this vulnerability through social engineering tactics, such as convincing a victim to download and execute a malicious file or run a specially crafted PowerShell command, leading to code execution on their local system. Table 3. Publicly disclosed zero-day vulnerability in PowerShell Severity CVSS Score CVE Description Important 7.8 CVE-2025-54100 PowerShell Remote Code Execution Vulnerability Two Critical Vulnerabilities in Microsoft Office CVE-2025-62554 and CVE-2025-62557 are Critical remote code execution vulnerabilities in Microsoft Office, both with CVSS scores of 8.4 . These vulnerabilities allow unauthenticated attackers to execute arbitrary code by exploiting a type confusion weakness (CVE-2025-62554) and a use-after-free condition (CVE-2025-62557) in Microsoft Office components. Exploitation requires no user interaction in the worst-case scenario and can be triggered by sending specially crafted malicious emails or links to the target user, with the preview pane serving as an attack vector for both vulnerabilities. The preview pane has been a continuous source of vulnerabilities, with at least one critical vulnerability each month this year except November. Table 4. Critical vulnerabilities in Microsoft Office Severity CVSS Score CVE Description Critical 8.4 CVE-2025-62554 Microsoft Office Remote Code Execution Vulnerability Critical 8.4 CVE-2025-62557 Microsoft Office Remote Code Execution Vulnerability Patch Tuesday Dashboard in the Falcon Platform For a visual overview of the systems impacted by this month’s vulnerabilities, you can use our Patch Tuesday dashboard. This can be found in the CrowdStrike Falcon® platform within the Exposure Management > Vulnerability Management > Dashboards page. The preset dashboards show the most recent three months of Patch Tuesday vulnerabilities. Not All Relevant Vulnerabilities Have Patches: Consider Mitigation Strategies As we have learned with other notable vulnerabilities, such as Log4j , not every highly exploitable vulnerability can be easily patched. As is the case for the ProxyNotShell vulnerabilities, it’s critically important to develop a response plan for how to defend your environments when no patching protocol exists. Regular review of your patching strategy should still be a part of your program, but you should also look more holistically at your organization's methods for cybersecurity and improve your overall security posture. Learn More The CrowdStrike Falcon platform regularly collects and analyzes trillions of endpoint events every day from millions of sensors deployed across 176 countries. Watch this demo to see the Falcon platform in action . Learn more about how CrowdStrike Falcon® Exposure Management can help you quickly and easily discover and prioritize vulnerabilities and other types of exposures here . About CVSS Scores The Common Vulnerability Scoring System (CVSS) is a free and open industry standard that CrowdStrike and many other cybersecurity organizations use to assess and communicate software vulnerabilities’ severity and characteristics. The CVSS Base Score ranges from 0.0 to 10.0, and the National Vulnerability Database (NVD) adds a severity rating for CVSS scores. Learn more about vulnerability scoring in this article . Additional Resources For more information on which products are in Microsoft’s Extended Security Updates program, refer to the vendor guidance here . Learn how Falcon Exposure Management can help you discover and manage vulnerabilities and other exposures in your environments. Make prioritization painless and efficient. Watch how Falcon Exposure Management enables IT staff to improve visibility with custom filters and team dashboards . Find out how CrowdStrike Falcon® Next-Gen Identity Security products can stop workforce identity threats faster. Test CrowdStrike next-gen antivirus for yourself with a free trial of CrowdStrike® Falcon Prevent™ . Tweet Share Related Content Inside the Latest Innovations Powering Falcon Exposure Management From Vulnerability Management to Exposure Management: The Platform Era Has Arrived November 2025 Patch Tuesday: One Zero-Day and Five Critical Vulnerabilities Among 63 CVEs Categories Agentic SOC 44 Cloud & Application Security 137 Data Protection 18 Endpoint Security & XDR 345 Engineering & Tech 85 Executive Viewpoint 176 Exposure Management 112 From The Front Lines 197 Next-Gen Identity Security 62 Next-Gen SIEM & Log Management 108 Public Sector 40 Securing AI 19 Threat Hunting & Intel 206 CONNECT WITH US FEATURED ARTICLES October 01, 2024 CrowdStrike Named a Leader in 2024 Gartner® Magic Quadrant™ for Endpoint Protection Platforms September 25, 2024 Recognizing the Resilience of the CrowdStrike Community September 25, 2024 CrowdStrike Drives Cybersecurity Forward with New Innovations Spanning AI, Cloud, Next-Gen SIEM and Identity Protection September 18, 2024 SUBSCRIBE Sign up now to receive the latest notifications and updates from CrowdStrike. Sign Up See CrowdStrike Falcon ® in Action Detect, prevent, and respond to attacks— even malware-free intrusions—at any stage, with next-generation endpoint protection. See Demo From Vulnerability Management to Exposure Management: The Platform Era Has Arrived Inside the Latest Innovations Powering Falcon Exposure Management Copyright © 2025 CrowdStrike Privacy Request Info Blog Contact Us 1.888.512.8906 Accessibility"
}