{
  "title": "RondoDox Botnet Exploits Critical React2Shell Flaw to Hijack IoT Devices and Web Servers",
  "link": "https://thehackernews.com/2026/01/rondodox-botnet-exploits-critical.html",
  "published": "Thu, 01 Jan 2026 14:49:00 +0530",
  "text": "RondoDox Botnet Exploits Critical React2Shell Flaw to Hijack IoT Devices and Web Servers #1 Trusted Cybersecurity News Platform Followed by 5.20+ million       Subscribe – Get Latest News  Home  Newsletter  Webinars Home Data Breaches Cyber Attacks Vulnerabilities Webinars Expert Insights Contact    Resources Webinars Free eBooks About Site About THN Jobs Advertise with us Contact/Tip Us  Reach out to get featured—contact us to send your exclusive story idea, research, hacks, or ask us a question or leave a comment/feedback! Follow Us On Social Media       RSS Feeds  Email Alerts RondoDox Botnet Exploits Critical React2Shell Flaw to Hijack IoT Devices and Web Servers  Jan 01, 2026  Ravie Lakshmanan Network Security / Vulnerability Cybersecurity researchers have disclosed details of a persistent nine-month-long campaign that has targeted Internet of Things (IoT) devices and web applications to enroll them into a botnet known as RondoDox. As of December 2025, the activity has been observed leveraging the recently disclosed React2Shell (CVE-2025-55182, CVSS score: 10.0) flaw as an initial access vector, CloudSEK said in an analysis. React2Shell is the name assigned to a critical security vulnerability in React Server Components (RSC) and Next.js that could allow unauthenticated attackers to achieve remote code execution on susceptible devices. According to statistics from the Shadowserver Foundation, there are about 90,300 instances that remain susceptible to the vulnerability as of December 31, 2025, out of which 68,400 instances are located in the U.S., followed by Germany (4,300), France (2,800), and India (1,500). RondoDox, which emerged in early 2025, has broadened its scale by adding new N-day security vulnerabilities to its arsenal, including CVE-2023-1389 and CVE-2025-24893 . It's worth noting that the abuse of React2Shell to spread the botnet was previously highlighted by Darktrace , Kaspersky , and VulnCheck . The RondoDox botnet campaign is assessed to have gone through three distinct phases prior to the exploitation of CVE-2025-55182 - March - April 2025 - Initial reconnaissance and manual vulnerability scanning April - June 2025 - Daily mass vulnerability probing of web applications like WordPress, Drupal, and Struts2, and IoT devices like Wavlink routers July - early December 2025 - Hourly automated deployment on a large-scale In the attacks detected in December 2025, the threat actors are said to have initiated scans to identify vulnerable Next.js servers, followed by attempts to drop cryptocurrency miners (\"/nuts/poop\"), a botnet loader and health checker (\"/nuts/bolts\"), and a Mirai botnet variant (\"/nuts/x86\") on infected devices. \"/nuts/bolts\" is designed to terminate competing malware and coin miners before downloading the main bot binary from its command-and-control (C2) server. One variant of the tool has been found to remove known botnets, Docker-based payloads, artifacts left from prior campaigns, and associated cron jobs, while also setting up persistence using \"/etc/crontab.\" \"It continuously scans /proc to enumerate running executables and kills non-whitelisted processes every ~45 seconds, effectively preventing reinfection by rival actors,\" CloudSEK said. To mitigate the risk posed by this threat, organizations are advised to update Next.js to a patched version as soon as possible, segment all IoT devices into dedicated VLANs, deploy Web Application Firewalls (WAFs), monitor for suspicious process execution, and block known C2 infrastructure. Found this article interesting? Follow us on Google News , Twitter and LinkedIn to read more exclusive content we post. SHARE      Tweet  Share  Share  Share   Share on Facebook  Share on Twitter  Share on Linkedin  Share on Reddit  Share on Hacker News  Share on Email  Share on WhatsApp Share on Facebook Messenger  Share on Telegram SHARE  botnet Cloud security cybersecurity Internet of Things Malware network security remote code execution Threat Intelligence Vulnerability Web Application Security Trending News DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide CSA Issues Alert on Critical SmarterMail Bug Allowing Remote Code Execution ⚡ Weekly Recap: MongoDB Attacks, Wallet Breaches, Android Spyware, Insider Crime and More MongoDB Vulnerability CVE-2025-14847 Under Active Exploitation Worldwide Trust Wallet Chrome Extension Breach Caused $7 Million Crypto Loss via Malicious Code Critical LangChain Core Vulnerability Exposes Secrets via Serialization Injection LastPass 2022 Breach Led to Years-Long Cryptocurrency Thefts, TRM Labs Finds Fortinet Warns of Active Exploitation of FortiOS SSL VPN 2FA Bypass Vulnerability New MacSync macOS Stealer Uses Signed App to Bypass Apple Gatekeeper Two Chrome Extensions Caught Secretly Stealing Credentials from Over 170 Sites U.S. DoJ Seizes Fraud Domain Behind $14.6 Million Bank Account Takeover Scheme Critical n8n Flaw (CVSS 9.9) Enables Arbitrary Code Execution Across Thousands of Instances Fake WhatsApp API Package on npm Steals Messages, Contacts, and Login Tokens Android Malware Operations Merge Droppers, SMS Theft, and RAT Capabilities at Scale Popular Resources Master CISSP, CCSP, and CISM With Zero Wasted Hours Level Up in Six Days: Join SANS Security Central 2026 in New Orleans Passwd - Get the Best Team Password Manager for Google Workspace See How Seraphic Turns Any Browser Into a Zero-Trust Enterprise Shield Cybersecurity Webinars Simplify SOC Operations How AI and Zero Trust Work Together to Catch Attacks With No Files or Indicators Modern cyberattacks hide in trusted tools and workflows, evading traditional defenses. Zero Trust and AI-powered cloud security give you the visibility and control to stop these invisible threats early. Register Stop Blind Trust in IDE AI Tools How to Audit MCP Servers and Stop Shadow API Key Sprawl in One Sweep Agentic AI is accelerating development—and risk. MCP servers and shadow API keys are spreading fast across IDEs. Learn how to regain visibility, enforce control, and secure agentic AI before speed turns into breach. Register Latest News Cybersecurity Resources Zero Trust + AI: Thrive in the AI Era and Remain Resilient Zero Trust Everywhere - protection across your workforce, branches, and clouds, and GenAI.. Attacks Are Rising. Are Your Cyber Skills Surge-Ready? Bigger threats, higher stakes. Build resilient SEC401 skills at SANS Surge 2026. Earn a Master's in Cybersecurity Risk Management Lead the future of cybersecurity risk management with an online Master's from Georgetown. ​ Expert Insights Articles Videos Purdue University's Real-World Deepfake Detection Benchmark Raises the Bar for Enterprise Models  December 22, 2025 Read ➝ AI in IAM: Is it Truly Valuable?  December 10, 2025 Read ➝ What GTG-1002 and Claude-Style Attacks Mean for SaaS Verification  December 8, 2025 Read ➝ Beyond Point-in-Time: The ROI Case for Continuous Pentesting  December 1, 2025 Read ➝ Get Latest News in Your Inbox Get the latest news, expert insights, exclusive resources, and strategies from industry leaders – all for free. Email Connect with us!  935,000 Followers  686,000 Followers  24,500 Subscribers  146,200 Followers  1,899,000 Followers 34,500 Followers Company About THN Advertise with us Contact Pages Webinars Privacy Policy  RSS Feeds  Contact Us © The Hacker News, 2025. All Rights Reserved."
}