{
  "title": "CrowdStrike Achieves 100% Detection, 100% Protection, and Zero False Positives in 2025 MITRE ATT&amp;CK&reg; Enterprise Evaluations",
  "link": "https://www.crowdstrike.com/en-us/blog/crowdstrike-achieves-100-percent-2025-mitre-attack-enterprise-evaluation/",
  "published": "Dec 10, 2025 00:00:00-0600",
  "text": "CrowdStrike Achieves 100%s in 2025 MITRE ATT&CK Enterprise Evaluation BLOG Featured Streamline Security Operations with Falcon for IT’s Turnkey Automations Dec 29, 2025 How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing Dec 22, 2025 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents Dec 19, 2025 CrowdTour 2026: Securing the AI Era Together Dec 19, 2025 Recent Streamline Security Operations with Falcon for IT’s Turnkey Automations Dec 29, 2025 How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing Dec 22, 2025 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents Dec 19, 2025 CrowdTour 2026: Securing the AI Era Together Dec 19, 2025 Video Video Highlights the 4 Key Steps to Successful Incident Response Dec 02, 2019 Helping Non-Security Stakeholders Understand ATT&CK in 10 Minutes or Less [VIDEO] Feb 21, 2019 Analyzing Targeted Intrusions Through the ATT&CK Framework Lens [VIDEO] Jan 22, 2019 Qatar’s Commercial Bank Chooses CrowdStrike Falcon®: A Partnership Based on Trust [VIDEO] Aug 20, 2018 Category Agentic SOC Agentic SOC How CrowdStrike Trains GenAI Models at Scale Using Distributed Computing 12/22/25 Inside CrowdStrike’s Science-Backed Approach to Building Expert SOC Agents 12/19/25 CrowdTour 2026: Securing the AI Era Together 12/19/25 CrowdStrike Leverages NVIDIA Nemotron in Amazon Bedrock to Advance Agentic Security 12/02/25 Cloud & Application Security Cloud & Application Security CrowdStrike Unveils Real-Time Cloud Detection and Response Innovations 12/01/25 New User Experience Transforms Interaction with the Falcon Platform 10/21/25 How Falcon ASPM Secures GenAI Applications and Lessons from Dogfooding 09/30/25 CrowdStrike Named a Frost Radar™ Leader in Cloud Workload Protection Platforms 09/25/25 Threat Hunting & Intel Threat Hunting & Intel Unveiling WARP PANDA: A New Sophisticated China-Nexus Adversary 12/04/25 CrowdStrike Research: Security Flaws in DeepSeek-Generated Code Linked to Political Triggers 11/20/25 CrowdStrike 2025 European Threat Landscape Report: Extortion Rises, Nation-State Activity Intensifies 11/03/25 CrowdStrike 2025 APJ eCrime Landscape Report: A New Era of Threats Emerges 10/20/25 Endpoint Security & XDR Endpoint Security & XDR Streamline Security Operations with Falcon for IT’s Turnkey Automations 12/29/25 CrowdStrike Endpoint Security Achieves 273% ROI Over Three Years 12/17/25 CrowdStrike Achieves 100% Detection, 100% Protection, and Zero False Positives in 2025 MITRE ATT&CK® Enterprise Evaluations 12/10/25 Defeating BLOCKADE SPIDER: How CrowdStrike Stops Cross-Domain Attacks 11/18/25 Engineering & Tech Engineering & Tech EMBER2024: Advancing the Training of Cybersecurity ML Models Against Evasive Malware 09/03/25 Falcon Platform Prevents COOKIE SPIDER’s SHAMOS Delivery on macOS 08/20/25 CrowdStrike’s Approach to Better Machine Learning Evaluation Using Strategic Data Splitting 08/11/25 CrowdStrike Researchers Develop Custom XGBoost Objective to Improve ML Model Release Stability 03/20/25 Executive Viewpoint Executive Viewpoint The Dawn of the Agentic SOC: Reimagining Cybersecurity for the AI Era 09/26/25 CrowdStrike Falcon Platform Evolves to Lead the Agentic Security Era 09/16/25 CrowdStrike to Acquire Pangea to Secure Enterprise AI Use and Development 09/15/25 CrowdStrike to Acquire Onum to Transform How Data Powers the Agentic SOC 08/27/25 From The Front Lines From The Front Lines CrowdStrike Named a Leader in 2025 IDC MarketScape for Worldwide Incident Response Services 08/27/25 CrowdStrike Launches New AI Security Services to Strengthen AI Security and SOC Readiness 08/06/25 CrowdStrike Detects and Blocks Initial SharePoint Zero-Day Exploitation 07/21/25 Prescription for Protection: Healthcare Industry Observations from CrowdStrike Investigations 07/01/25 Next-Gen Identity Security Next-Gen Identity Security Falcon Shield Evolves with AI Agent Visibility and Falcon Next-Gen SIEM Integration 12/08/25 CrowdStrike Named Overall Leader in 2025 KuppingerCole ITDR Leadership Compass 11/10/25 CrowdStrike Named the Leader in 2025 Frost Radar for SaaS Security Posture Management 10/27/25 From Domain User to SYSTEM: Analyzing the NTLM LDAP Authentication Bypass Vulnerability (CVE-2025-54918) 10/22/25 Next-Gen SIEM & Log Management Next-Gen SIEM & Log Management Transform AWS Security Operations with Falcon Next-Gen SIEM 12/01/25 CrowdStrike Leads New Evolution of Security Automation with Charlotte Agentic SOAR 11/05/25 CrowdStrike Named a Visionary in 2025 Gartner® Magic Quadrant™ for Security Information and Event Management 10/10/25 CrowdStrike Boosts SOC Detection Content with Correlation Rule Template Discovery Dashboard 09/29/25 Public Sector Public Sector CrowdStrike Achieves FedRAMP® High Authorization 03/19/25 NHS Matures Healthcare Cybersecurity with NCSC’s CAF Assurance Model 03/13/25 Zero Trust Strengthens Data Protection to Achieve National Cyber Strategy Goals 01/15/25 CrowdStrike Statement on Bloomberg’s October 25, 2024 Story 10/25/24 Exposure Management Exposure Management Inside the Latest Innovations Powering Falcon Exposure Management 12/12/25 December 2025 Patch Tuesday: One Critical Zero-Day, Two Publicly Disclosed Vulnerabilities Among 57 CVEs 12/09/25 From Vulnerability Management to Exposure Management: The Platform Era Has Arrived 11/13/25 November 2025 Patch Tuesday: One Zero-Day and Five Critical Vulnerabilities Among 63 CVEs 11/12/25 Data Protection Data Protection Falcon Data Protection for Cloud Extends DSPM into Runtime 11/20/25 CrowdStrike Stops GenAI Data Leaks with Unified Data Protection 09/18/25 Q&A: How Mastronardi Produce Secures Innovation with CrowdStrike 02/14/25 5 Key Data Protection Challenges and How to Overcome Them 12/11/24 Securing AI Securing AI CrowdStrike Secures Growing AI Attack Surface with Falcon AI Detection and Response 12/15/25 Data Leakage: AI’s Plumbing Problem 12/11/25 Indirect Prompt Injection Attacks: A Lurking Risk to AI Systems 12/04/25 Secure AI at Machine Speed: Defending the Growing Attack Surface 09/02/25 Start Free Trial Featured Recent Video Category Start Free Trial CrowdStrike Achieves 100% Detection, 100% Protection, and Zero False Positives in 2025 MITRE ATT&CK® Enterprise Evaluations The CrowdStrike Falcon platform achieved flawless 100% detection, 100% prevention, and zero false positives in the industry’s most demanding cross-domain platform evaluation to date. December 10, 2025 | Elia Zaitsev | Endpoint Security & XDR The CrowdStrike Falcon® platform delivered flawless 100% detection, 100% protection, and zero false positives in the 2025 MITRE ATT&CK® Enterprise Evaluations, the industry's most demanding and comprehensive cross-domain security assessment to date. CrowdStrike's results demonstrate the precision and real-world effectiveness of the AI-native Falcon platform, which excelled in MITRE's expanded evaluation — now spanning endpoint, identity, and cloud security across hybrid environments. We delivered 100% technique-level detail, which identifies adversary activity at the ATT&CK Technique or Sub-Technique level and provides analysts with critical context on execution, impact, and adversary behavior. CrowdStrike provided all of this detail with zero false positives while achieving 100% detection and 100% protection, including real-time cloud prevention. Achieving both perfect detection and perfect protection without generating false positives or flooding security teams with unnecessary alerts is extremely challenging. Achieving this in a single pane of glass, delivered through one platform, across a cross-domain attack demonstrates the power of the Falcon platform. Figure 1. Cohort-wide detection coverage after all execution runs were completed. CrowdStrike achieved 100% detection coverage across all ATT&CK techniques tested. The Industry's Most Demanding Cross-Domain Evaluation Yet This year’s assessment used the observed tactics and techniques of both cybercriminal and state-sponsored groups to create a comprehensive cross-domain evaluation. Cloud-based attack tradecraft was introduced for the first time, marking a significant expansion in scope. Also new for 2025 was the inclusion of the MITRE ATT&CK Reconnaissance tactic, which assessed vendors’ ability to detect adversary activity at the earliest information gathering stages, before a targeted attack can inflict significant damage. The Falcon platform delivered complete coverage against sophisticated adversary tradecraft spanning endpoint, identity, and cloud environments, demonstrating the value of its key innovations. These include Falcon endpoint security modules for detecting living-off-the-land and dual-use tool abuse, CrowdStrike Falcon® Next-Gen Identity Security for stopping credential abuse and lateral movement from unmanaged hosts, CrowdStrike Falcon® Cloud Security for protecting cloud control planes in real time, and CrowdStrike Falcon® Next-Gen SIEM for critical correlation and seamless case management for unifying detections and AI insights for analyst collaboration when every second counts. Figure 2. Protection Test 6 was a Noise test. “Reported” means a vendor reported a false positive. “Not reported” means a vendor did not report on benign activity, which is what customers should expect. Protection Test 2 was discarded by MITRE for all vendors. Throughout both detection and protection scenarios, the Falcon platform achieved perfect coverage while maintaining the high-fidelity, no-noise alerting that security teams demand. Alert fatigue can easily overwhelm defenders, which can potentially lead to missing real threats. On Protection Test 6 in particular, CrowdStrike was successful in not reporting on any benign activity. It is important to note that a “Reported” label indicates the vendor reported a false positive on the noise test, which is what customers should expect. Protection Test 2 was discarded by MITRE for all vendors. These results validate CrowdStrike's approach to unified, cross-domain security in an era where threats seamlessly traverse security domain boundaries. The evaluation's inclusion of alert efficiency and detection accuracy metrics showcase the Falcon platform’s delivery of contextual, actionable information while minimizing noise and benign alert activity. This supports the ability for security teams to operate effectively in today's complex threat landscape. Confronting Modern Cross-Domain Tradecraft The 2025 evaluation emulated two distinct adversaries representing the evolving threat landscape organizations face today. The first detection scenario involved eCrime adversary SCATTERED SPIDER executing a hybrid intrusion involving social engineering, identity abuse, and cloud exploitation. This emulated attack employed sophisticated techniques including MFA bypass, credential theft, and remote access tools, highlighting the critical need for unified visibility and protection across identity and cloud environments. The second detection scenario involved the People's Republic of China (PRC) state-sponsored espionage group known as MUSTANG PANDA conducting a sophisticated, long-dwell attack featuring legitimate tool abuse and custom malware. This emulated attack demonstrated stealthy persistence and living-off-the-land techniques, which require advanced behavioral detection and cross-domain correlation capabilities. The emulated tradecraft reflected the complexity of modern threats, including: Cross-domain attack chains spanning endpoint, identity, and cloud Valid account abuse across hybrid identity environments Cloud control plane infiltration targeting APIs and cloud services Dual-use tool exploitation leveraging legitimate remote management and monitoring (RMM) software and living-off-the-land binaries (LOLbins) Advanced evasion techniques designed to bypass traditional security controls These scenarios pushed the boundaries of what traditional security solutions can handle but were no match for the Falcon platform. Inside the Attack Scenarios: Advanced Tradecraft Meets AI-Powered Defense Identity Security One of the most challenging scenarios involved SCATTERED SPIDER's sophisticated use of compromised credentials to move laterally across hybrid environments while employing MFA bypass techniques and leveraging legitimate remote access tools to maintain persistence. The adversary's approach was designed to blend in with normal business activities, making detection particularly difficult for traditional solutions. Falcon Next-Gen Identity Security, integrated with Falcon Next-Gen SIEM third-party log ingest, identified anomalous authentication patterns and flagged the compromised accounts. Falcon endpoint security modules correlated this activity with endpoint behaviors to provide complete attack context. A key element of the protection evaluation involved accessing systems via an unmanaged host in an attempt to evade detection, which Falcon Next-Gen Identity Security was easily able to prevent. The Falcon platform's ability to see across identity and endpoint domains enabled rapid detection and response, stopping the attack before the adversary could achieve their objectives. Cloud Security For the first time in the history of the MITRE ATT&CK evaluation, the emulation featured adversary exploitation of the cloud control plane. There were two key scenarios tested: Hybrid Detection : Using stolen credentials and session replay, an attack emulating SCATTERED SPIDER bypassed MFA via SSO and entered the AWS console, where they mapped IAM and S3 while probing defenses. They hid their activity with email rules, attempted firewall tampering, created a privileged backdoor, and launched a pivot EC2 instance — all of which enabled rerouting data flows to their controlled S3 bucket. They finished the operation with targeted file theft via a third-party tool while blending into normal activity. Falcon Cloud Security detected 100% of the techniques and automatically deployed a sensor on the EC2 instance, which provided complete visibility into the entire kill chain with telemetry from across the system level and the cloud control plane. Protection : The adversary used stolen credentials to gain access to an AWS console, establish an IAM role with administrative privileges, and launch an EC2 instance with that role attached. In just seconds, Falcon Cloud Security detected these suspicious cloud behaviors and based on the sequence of these events, took action to contain the attack in real-time. It then was able to deny further access to the compromised credentials and shut down the EC2 instance, while preserving the instance disk for forensic investigation. With Falcon Cloud Security’s real-time cloud detection and response and Real-Time Cloud IOAs, analysts can gain instant visibility into cloud control plane activity and spot and stop adversaries early. Additionally, CrowdStrike takes a prevention-first approach with sensor-based runtime protection and automated, cloud-native responses working together to automatically contain threats across the cloud stack. Threat Intelligence In the MUSTANG PANDA scenario, the adversary embedded encoded shellcode within their malware in an attempt to evade security products. The malware subsequently reflectively loaded and executed the shellcode. CrowdStrike’s static and dynamic analysis capabilities were used to quickly investigate files of interest and deliver precise intelligence that was automatically converted into detections and protections through CrowdStrike Falcon® Fusion SOAR — without analyst involvement. CrowdStrike Falcon® Adversary Intelligence’s integrated static analysis quickly triages files, extracts configurations, identifies code relationships, and correlates samples to known malware families. Dynamic sandbox detonations then provide rich behavioral intelligence by observing real execution, uncovering adversary command-and-control activity, persistence mechanisms, and evasion techniques. Together, these capabilities transform suspicious files into actionable intelligence and detections within seconds, enabling rapid triage, adversary attribution, and automated defense aligned to adversary TTPs. Built into the Falcon Platform Dual Use Tools : The adversary scenarios heavily featured the abuse of legitimate tools from remote management software to living-off-the-land techniques. This is particularly challenging because it involves the misuse of authorized software and system utilities that organizations depend on for legitimate business operations. The Falcon platform's AI-powered behavioral analysis successfully distinguished between legitimate and malicious use of these tools, achieving perfect detection without generating false positives on normal business activities. This precision is critical for organizations that rely on these tools for legitimate purposes and cannot afford to have their operations disrupted by false alarms. Case Management : The 2025 evaluation also measured alert efficiency. MITRE uses an alert volume metric to measure the number of alerts that would require triage by a SOC analyst. Alert fatigue is a common challenge that can overwhelm defenders, leading to missed alerts and delayed responses. The Falcon platform’s case-centric approach to investigation and response proved to be critical for maximizing alert efficiency and minimizing noise from false or benign alerts, as highlighted in Protection Test 6 of the evaluations. Integrated case management empowers analysts to build or automate the creation of cases, either based on detections or from scratch, using pre-defined or customizable templates to guide triage and resolution. From there, they can assign tasks, track progress, visualize the investigation, and automate workflows via Falcon Fusion SOAR to take action, all within the unified Falcon platform. Reconnaissance : The evaluation's inclusion of the Reconnaissance tactic for the first time in 2025 added another layer of complexity, as adversaries employed sophisticated information-gathering techniques to map target environments before launching their attacks. The Falcon platform's comprehensive visibility across all attack surfaces enabled detection of these early-stage activities. In a real-world scenario, this is critical for providing security teams with the early warning they need to prepare defenses and potentially prevent attacks before they fully develop. Meeting the Moment for Cross-Domain Security CrowdStrike's performance in the 2025 MITRE ATT&CK Enterprise Evaluations validates our vision of unified, AI-native security and demonstrates what modern defense looks like in an era where threats go beyond traditional security boundaries. The Falcon platform's ability to achieve 100% detection and 100% protection with zero false positives while maintaining high-fidelity alerting showcases how organizations don't have to choose between comprehensive coverage and operational efficiency to defeat modern adversaries. The 2025 MITRE ATT&CK Enterprise Evaluations highlight the critical importance of not just detecting threats but responding to them quickly and effectively. As threats continue to evolve and span multiple domains, organizations need a platform that can see and stop attacks wherever they occur. The evaluations’ expanded scope this year reflects the reality that modern threats are now truly cross-domain. Our results demonstrate that the Falcon platform is engineered for this new reality, delivering the cross-domain protection, AI-powered precision, and unified visibility that organizations need to stop today's most sophisticated adversaries. At CrowdStrike, we believe rigorous independent testing provides customers with the transparency and insight they need to make informed security decisions. Our results in the most demanding MITRE evaluation to date prove that with the Falcon platform, adversaries truly have nowhere to hide, whether they're targeting endpoints, identities, cloud infrastructure, or all three. We stop breaches by seeing everything, understanding everything, and acting faster than the adversary can adapt. Additional Resources Want to learn more? 5 Things to Know About the MITRE ATT&CK Evaluations: Enterprise 2025 For full results and more information about the evaluations, visit here . Register now for the CrowdStrike CrowdCast on the MITRE ATT&CK® Enterprise Evaluations on December 18. Tweet Share Related Content Streamline Security Operations with Falcon for IT’s Turnkey Automations CrowdStrike Endpoint Security Achieves 273% ROI Over Three Years Defeating BLOCKADE SPIDER: How CrowdStrike Stops Cross-Domain Attacks Categories Agentic SOC 44 Cloud & Application Security 137 Data Protection 18 Endpoint Security & XDR 345 Engineering & Tech 85 Executive Viewpoint 176 Exposure Management 112 From The Front Lines 197 Next-Gen Identity Security 62 Next-Gen SIEM & Log Management 108 Public Sector 40 Securing AI 19 Threat Hunting & Intel 206 CONNECT WITH US FEATURED ARTICLES October 01, 2024 CrowdStrike Named a Leader in 2024 Gartner® Magic Quadrant™ for Endpoint Protection Platforms September 25, 2024 Recognizing the Resilience of the CrowdStrike Community September 25, 2024 CrowdStrike Drives Cybersecurity Forward with New Innovations Spanning AI, Cloud, Next-Gen SIEM and Identity Protection September 18, 2024 SUBSCRIBE Sign up now to receive the latest notifications and updates from CrowdStrike. Sign Up See CrowdStrike Falcon ® in Action Detect, prevent, and respond to attacks— even malware-free intrusions—at any stage, with next-generation endpoint protection. See Demo Defeating BLOCKADE SPIDER: How CrowdStrike Stops Cross-Domain Attacks CrowdStrike Endpoint Security Achieves 273% ROI Over Three Years Copyright © 2025 CrowdStrike Privacy Request Info Blog Contact Us 1.888.512.8906 Accessibility"
}