{
  "title": "HTTP Parsing Vulnerabilities in Check Point Firewall-1",
  "link": "https://www.cisa.gov/news-events/alerts/2004/02/05/http-parsing-vulnerabilities-check-point-firewall-1",
  "published": "Thu, 05 Feb 04 12:00:00 +0000",
  "text": "HTTP Parsing Vulnerabilities in Check Point Firewall-1 | CISA Skip to main content An official website of the United States government Here’s how you know Here’s how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( ) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites. no-cost Cyber Services Secure by design Holiday Online Shopping Safety Shields Up Report A Cyber Issue Search Menu Close Topics Topics Cybersecurity Best Practices Cyber Threats and Advisories Critical Infrastructure Security and Resilience Election Security Emergency Communications Industrial Control Systems Information and Communications Technology Supply Chain Security Partnerships and Collaboration Physical Security Risk Management How can we help? Government Educational Institutions Industry State, Local, Tribal, and Territorial Individuals and Families Small and Medium Businesses Find Help Locally Faith-Based Community Executives High-Risk Communities Spotlight Resources & Tools Resources & Tools All Resources & Tools Services Programs Resources Training Groups News & Events News & Events News Events Cybersecurity Alerts & Advisories Directives Request a CISA Speaker Congressional Testimony CISA Conferences CISA Live! Careers Careers Benefits & Perks HireVue Applicant Reasonable Accommodations Process Hiring Resume & Application Tips Students & Recent Graduates Veteran and Military Spouses About About Divisions & Offices Regions Leadership Doing Business with CISA Site Links CISA GitHub CISA Central Contact Us Subscribe Transparency and Accountability Policies & Plans no-cost Cyber Services Secure by design Holiday Online Shopping Safety Shields Up Report A Cyber Issue Breadcrumb Home News & Events Cybersecurity Advisories Alert HTTP Parsing Vulnerabilities in Check Point Firewall-1 Share: Archived Content In an effort to keep CISA.gov current, the archive contains outdated information that may not reflect current policy or programs. Alert HTTP Parsing Vulnerabilities in Check Point Firewall-1 Last Revised February 06, 2004 Alert Code TA04-036A Systems Affected Check Point Firewall-1 NG FCS Check Point Firewall-1 NG FP1 Check Point Firewall-1 NG FP2 Check Point Firewall-1 NG FP3, HF2 Check Point Firewall-1 NG with Application Intelligence R54 Check Point Firewall-1 NG with Application Intelligence R55 Overview Several versions of Check Point Firewall-1 contain a vulnerability that allows remote attackers to execute arbitrary code with administrative privileges. This allows the attacker to take control of the firewall and the server it runs on. Description The Application Intelligence (AI) component of Check Point Firewall-1 is an application proxy that scans traffic for application layer attacks once it has passed through the firewall at the network level. Earlier versions of Firewall-1 include the HTTP Security Server, which provides similar functionality. Both the AI and HTTP Security Server features contain an HTTP parsing vulnerability that is triggered by sending an invalid HTTP request through the firewall. When Firewall-1 generates an error message in response to the invalid request, a portion of the input supplied by the attacker is included in the format string for a call to sprintf(). Researchers at Internet Security Systems have determined that it is possible to exploit this format string vulnerability to execute commands on the firewall. The researchers have also determined that this vulnerability can be exploited as a heap overflow, which would allow an attacker to execute arbitrary code. In either case, the commands or code executed by the attacker would run with administrative privileges, typically \"SYSTEM\" or \"root\". For more information, please see the ISS advisory at: http://xforce.iss.net/xforce/alerts/id/162 The CERT/CC is tracking this issue as VU#790771. This reference number corresponds to CVE candidate CAN-2004-0039. Impact This vulnerability allows remote attackers to execute arbitrary code on affected firewalls with administrative privileges, typically \"SYSTEM\" or \"root\". Solution Apply the patch from Check Point Check Point has published a \"Firewall-1 HTTP Security Server Update\" that modifies the error return strings used when an invalid HTTP request is detected. For more information, please see the Check Point bulletin at: http://www.checkpoint.com/techsupport/alerts/security_server.html Disable the affected components Check Point has reported that their products are only affected by this vulnerability if the HTTP Security Servers feature is enabled. Therefore, affected sites may be able to limit their exposure to this vulnerability by disabling HTTP Security Servers or the Application Intelligence component, as appropriate. This vulnerability was discovered and researched by Mark Dowd of ISS X-Force. This document was written by Jeffrey P. Lanza. This document is available from http://www.us-cert.gov/cas/techalerts/TA04-036A.html Revision History 02/05/2004: Initial release 02/06/2004: Updated Solution section 02/06/2004: Updated Overview and Impact sections Last updated This product is provided subject to this Notification and this Privacy & Use policy. Please share your thoughts We recently updated our anonymous product survey ; we welcome your feedback. Return to top Topics Spotlight Resources & Tools News & Events Careers About Cybersecurity & Infrastructure Security Agency Facebook X LinkedIn YouTube Instagram RSS CISA Central 1-844-Say-CISA contact@cisa.dhs.gov DHS Seal CISA.gov An official website of the U.S. Department of Homeland Security About CISA Budget and Performance DHS.gov FOIA Requests No FEAR Act Office of Inspector General Privacy Policy Subscribe The White House USA.gov Website Feedback"
}