{
  "title": "DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide",
  "link": "https://thehackernews.com/2025/12/darkspectre-browser-extension-campaigns.html",
  "published": "Wed, 31 Dec 2025 21:44:00 +0530",
  "text": "DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide #1 Trusted Cybersecurity News Platform Followed by 5.20+ million       Subscribe – Get Latest News  Home  Newsletter  Webinars Home Data Breaches Cyber Attacks Vulnerabilities Webinars Expert Insights Contact    Resources Webinars Free eBooks About Site About THN Jobs Advertise with us Contact/Tip Us  Reach out to get featured—contact us to send your exclusive story idea, research, hacks, or ask us a question or leave a comment/feedback! Follow Us On Social Media       RSS Feeds  Email Alerts DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide  Dec 31, 2025  Ravie Lakshmanan Malware / Ad Fraud The threat actor behind two malicious browser extension campaigns, ShadyPanda and GhostPoster , has been attributed to a third attack campaign codenamed DarkSpectre that has impacted 2.2 million users of Google Chrome, Microsoft Edge, and Mozilla Firefox. The activity is assessed to be the work of a Chinese threat actor that Koi Security is tracking under the moniker DarkSpectre . In all, the campaigns have collectively affected over 8.8 million users spanning a period of more than seven years. ShadyPanda was first unmasked by the cybersecurity company earlier this month as targeting all three browser users to facilitate data theft, search query hijacking, and affiliate fraud. It has been found to affect 5.6 million users, including 1.3 newly identified victims stemming from over 100 extensions flagged as connected to the same cluster. This also includes an Edge add-on named \"New Tab - Customized Dashboard\" that features a logic bomb that waits for three days prior to triggering its malicious behavior. The time-delayed activation is an attempt to give the impression that it's legitimate during the review period and get it approved. Nine of these extensions are currently active, with an additional 85 \"dormant sleepers\" that are benign and meant to attract a user base before they are weaponized via malicious updates. Koi said the updates were introduced after more than five years in some cases. The second campaign, GhostPoster, is mostly focused on Firefox users, targeting them with seemingly harmless utilities and VPN tools to serve malicious JavaScript code designed to hijack affiliate links, inject tracking code, and commit click and ad fraud. Further investigation into the activity has unearthed more browser add-ons, including a Google Translate (developer \"charliesmithbons\") extension for Opera with nearly one million installs. The most recent discovery, The Zoom Stealer, is the third such campaign from DarkSpectre, employing a set of 18 extensions across Chrome, Edge, and Firefox for facilitating corporate intelligence by collecting online meeting-related data like meeting URLs with embedded passwords, meeting IDs, topics, descriptions, scheduled times, and registration status. The list of identified extensions and their corresponding IDs is below - Google Chrome - Chrome Audio Capture (kfokdmfpdnokpmpbjhjbcabgligoelgp) ZED: Zoom Easy Downloader (pdadlkbckhinonakkfkdaadceojbekep) X (Twitter) Video Downloader (akmdionenlnfcipmdhbhcnkighafmdha) Google Meet Auto Admit (pabkjoplheapcclldpknfpcepheldbga) Zoom.us Always Show \"Join From Web\" (aedgpiecagcpmehhelbibfbgpfiafdkm) Timer for Google Meet (dpdgjbnanmmlikideilnpfjjdbmneanf) CVR: Chrome Video Recorder (kabbfhmcaaodobkfbnnehopcghicgffo) GoToWebinar & GoToMeeting Download Recordings (cphibdhgbdoekmkkcbbaoogedpfibeme) Meet auto admit (ceofheakaalaecnecdkdanhejojkpeai) Google Meet Tweak (Emojis, Text, Cam Effects) (dakebdbeofhmlnmjlmhjdmmjmfohiicn) Mute All on Meet (adjoknoacleghaejlggocbakidkoifle) Google Meet Push-To-Talk (pgpidfocdapogajplhjofamgeboonmmj) Photo Downloader for Facebook, Instagram, + (ifklcpoenaammhnoddgedlapnodfcjpn) Zoomcoder Extension (ebhomdageggjbmomenipfbhcjamfkmbl) Auto-join for Google Meet (ajfokipknlmjhcioemgnofkpmdnbaldi) Microsoft Edge - Edge Audio Capture (mhjdjckeljinofckdibjiojbdpapoecj) Mozilla Firefox - Twiter X Video Downloader ({7536027f-96fb-4762-9e02-fdfaedd3bfb5}, published by \"invaliddejavu\") x-video-downloader (xtwitterdownloader@benimaddonum.com, published by \"invaliddejavu\") As is evident by the names of the extensions, a majority of them are engineered to mimic tools for enterprise-oriented videoconferencing applications like Google Meet, Zoom, and GoTo Webinar to exfiltrate meeting links, credentials, and participant lists over a WebSocket connection in real-time. It's also capable of harvesting details about webinar speakers and hosts, such as names, titles, bios, profile photos, and company affiliations, along with logos, promotional graphics, and session metadata, every time a user visits a webinar registration page via the browser with one of the extensions installed. These add-ons have been found to request access to more than 28 video conferencing platforms, including Cisco WebEx, Google Meet, GoTo Webinar, Microsoft Teams, and Zoom, among others, regardless of whether they required access to them in the first place. \"This isn't consumer fraud - this is corporate espionage infrastructure,\" researchers Tuval Admoni and Gal Hachamov said. \"The Zoom Stealer represents something more targeted: systematic collection of corporate meeting intelligence. Users got what was advertised. The extensions earned trust and positive reviews. Meanwhile, surveillance ran silently in the background.\" The cybersecurity company said the gathered information could be used to fuel corporate espionage by selling the data to other bad actors, and enable social engineering and large-scale impersonation operations. The Chinese links to the operation are based on several clues: consistent use of command-and-control (C2) servers hosted on Alibaba Cloud, Internet Content Provider (ICP) registrations linked to Chinese provinces like Hubei, code artifacts containing Chinese-language strings and comments, and fraud schemes specifically aimed at Chinese e-commerce platforms such as JD.com and Taobao. \"DarkSpectre likely has more infrastructure in place right now – extensions that look completely legitimate because they are legitimate, for now,\" Koi said. \"They're still in the trust-building phase, accumulating users, earning badges, waiting.\" Found this article interesting? Follow us on Google News , Twitter and LinkedIn to read more exclusive content we post. SHARE      Tweet  Share  Share  Share   Share on Facebook  Share on Twitter  Share on Linkedin  Share on Reddit  Share on Hacker News  Share on Email  Share on WhatsApp Share on Facebook Messenger  Share on Telegram SHARE  ad fraud Browser Extension corporate espionage cybersecurity data theft Google Chrome Malware Microsoft Edge Mozilla Firefox Threat Intelligence Trending News DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide CSA Issues Alert on Critical SmarterMail Bug Allowing Remote Code Execution ⚡ Weekly Recap: MongoDB Attacks, Wallet Breaches, Android Spyware, Insider Crime and More MongoDB Vulnerability CVE-2025-14847 Under Active Exploitation Worldwide Trust Wallet Chrome Extension Breach Caused $7 Million Crypto Loss via Malicious Code Critical LangChain Core Vulnerability Exposes Secrets via Serialization Injection LastPass 2022 Breach Led to Years-Long Cryptocurrency Thefts, TRM Labs Finds Fortinet Warns of Active Exploitation of FortiOS SSL VPN 2FA Bypass Vulnerability New MacSync macOS Stealer Uses Signed App to Bypass Apple Gatekeeper Two Chrome Extensions Caught Secretly Stealing Credentials from Over 170 Sites U.S. DoJ Seizes Fraud Domain Behind $14.6 Million Bank Account Takeover Scheme Critical n8n Flaw (CVSS 9.9) Enables Arbitrary Code Execution Across Thousands of Instances Fake WhatsApp API Package on npm Steals Messages, Contacts, and Login Tokens Android Malware Operations Merge Droppers, SMS Theft, and RAT Capabilities at Scale Popular Resources Master CISSP, CCSP, and CISM With Zero Wasted Hours Level Up in Six Days: Join SANS Security Central 2026 in New Orleans Passwd - Get the Best Team Password Manager for Google Workspace See How Seraphic Turns Any Browser Into a Zero-Trust Enterprise Shield Cybersecurity Webinars Simplify SOC Operations How AI and Zero Trust Work Together to Catch Attacks With No Files or Indicators Modern cyberattacks hide in trusted tools and workflows, evading traditional defenses. Zero Trust and AI-powered cloud security give you the visibility and control to stop these invisible threats early. Register Stop Blind Trust in IDE AI Tools How to Audit MCP Servers and Stop Shadow API Key Sprawl in One Sweep Agentic AI is accelerating development—and risk. MCP servers and shadow API keys are spreading fast across IDEs. Learn how to regain visibility, enforce control, and secure agentic AI before speed turns into breach. Register Latest News Cybersecurity Resources Zero Trust + AI: Thrive in the AI Era and Remain Resilient Zero Trust Everywhere - protection across your workforce, branches, and clouds, and GenAI.. Attacks Are Rising. Are Your Cyber Skills Surge-Ready? Bigger threats, higher stakes. Build resilient SEC401 skills at SANS Surge 2026. Earn a Master's in Cybersecurity Risk Management Lead the future of cybersecurity risk management with an online Master's from Georgetown. ​ Expert Insights Articles Videos Purdue University's Real-World Deepfake Detection Benchmark Raises the Bar for Enterprise Models  December 22, 2025 Read ➝ AI in IAM: Is it Truly Valuable?  December 10, 2025 Read ➝ What GTG-1002 and Claude-Style Attacks Mean for SaaS Verification  December 8, 2025 Read ➝ Beyond Point-in-Time: The ROI Case for Continuous Pentesting  December 1, 2025 Read ➝ Get Latest News in Your Inbox Get the latest news, expert insights, exclusive resources, and strategies from industry leaders – all for free. Email Connect with us!  935,000 Followers  686,000 Followers  24,500 Subscribers  146,200 Followers  1,899,000 Followers 34,500 Followers Company About THN Advertise with us Contact Pages Webinars Privacy Policy  RSS Feeds  Contact Us © The Hacker News, 2025. All Rights Reserved."
}